title: Kerberos TGS Request (TGS-REQ) with RC4 Encryption (Zeek)
name: kerberos_tgs_request_with_rc4_encryption_zeek
description: Alert triggers when the Kerberos TGS-REQ request is made with insecure RC4 encryption
version: 0.1
ttp: Kerberoasting
stage: 
  - Exploitation
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 01.08.2022
references:
  - https://blog.harmj0y.net/redteaming/kerberoasting-revisited/
  - https://adsecurity.org/?p=3458
  - https://docs.zeek.org/en/master/scripts/base/protocols/krb/main.zeek.html
tags:
  - attack.credential_access
  - attack.t1558.003
logsource: 
  product: zeek
  service: kerberos
detection: 
  selection: 
    request_type: "TGS"
    cipher: "rc4-hmac"
  reduction1: 
    service|endswith: 
      - "$" # Exclude machine accounts 
  reduction2: 
    service|startswith: 
      - "krbtgt/" # Exclude krbtgt account
  condition: selection and not (reduction1 or reduction2)
falsepositives:
  - Legacy systems (before Win2008/Win7) or applications (Low)
  - Ticket requests for inter domain or inter forest services (High if trusts enabled)
weaknesses:
  - Attackers can bypass this rule with using AES or another secure supported encryption
fine-tune:
  - Rule precision can be improved by excluding known old/legacy systems/apps and users
  - Rule can also applied with count-based correlation for the same host
level: medium

# Correlation based on event count for the same host
# You need to change timespan and condition values according the your environment
action: correlation
name: multiple_kerberos_tgs_request_with_rc4_encryption_zeek_by_same_host
type: event_count
rule: kerberos_tgs_request_with_rc4_encryption_zeek
group-by:
  - id.orig_h
timespan: 5s
condition:
  gte: 5
weaknesses:
  - Attackers can bypass this correlation by slowing down their requests and changing the host
