title: msDS-SupportedEncryptionTypes Attribute Modification on User Accounts
name: msds_SupportedEncryptionTypes_attribute_modification_on_user_accounts
description: Alert triggers when the new encrtyption is added to the msDS-SupportedEncryptionTypes attribute for user accounts
version: 0.1
ttp: Multiple
stage: 
  - Vulnerability
status: test 
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 01.08.2022
references:
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/fc59342d-e93c-498c-b030-53bbd6da9a11
  - https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/decrypting-the-selection-of-supported-kerberos-encryption-types/ba-p/1628797
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-directory-service-changes
  - https://docs.microsoft.com/tr-tr/archive/blogs/motiba/detecting-kerberoasting-activity-using-azure-security-center
tags:
    - attack.credential_access
    - attack.t1558.003
logsource: 
  product: windows
  service: security
  definition: 
    - Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > DS Access > Audit Directory Service Changes
    - Requires SACL definition with "Write msDS-SupportedEncryptionTypes" permission for "Everyone" principal on the object to audit write actions by anyone.
detection: 
  selection: 
    EventID: 5136
    LDAP_Display_Name: "msDS-SupportedEncryptionTypes"
    Type: "Value Added"
  reduction1:
    Class: "user" # Filter only user objects (Object)
  reduction2:
    Account_Name|endswith: "$" # Exclude machine accounts (Subject)
  condition: selection and reduction1 and not reduction2
falsepositives:
  - Legitimate or product related write actions on msDS-SupportedEncryptionTypes attribute (Low)
  - msDS-SupportedEncryptionTypes modification to enable stronger encryption schemes (Low)
weaknesses:
  - Attackers can bypass this rule with using a compromised machine account because of the reduction2
fine-tune:
  - Hex calculations on the Value attribute for secure encryption schemes will reduce the FP rate
  - Decoy accounts can be used with this rule to reduce the FP rate
  - Rule precision can be improved by excluding known objects which modifies msDS-SupportedEncryptionTypes attribute
  - Subject reduction can be applied through SACL with deny entries
level: medium
