title: Kerberos TGT Request (AS-REQ) with RC4 Encryption (Possible malicious tool usage Mimikatz/Rubeus etc)
name: kerberos_tgt_request_with_rc4_encryption_zeek
description: Alert triggers when the Kerberos AS-REQ request is made with insecure RC4 encryption, it mostly triggered by Mimikatz or Rubeus
version: 0.1
ttp: Multiple
stage: 
  - Exploitation
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 27.07.2022
references:
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/network-security-configure-encryption-types-allowed-for-kerberos
  - https://docs.zeek.org/en/master/scripts/base/protocols/krb/main.zeek.html
tags:
    - attack.credential_access
    - attack.t1558.004
logsource: 
  product: zeek
  service: kerberos
  definition:
    - You need to enable Zeek for network packet analysis or can implement rule to your current IDS/NDR or related product
detection: 
  selection: 
    request_type: 'AS' # Authentication Service request
    cipher: 'rc4-hmac'
  condition: selection
falsepositives:
  - Legacy systems (before Win2008/WinVista) or applications (Medium)
  - Ticket requests for inter domain or inter forest services (High if trusts enabled)
weaknesses:
  - Attackers can bypass this rule with using AES or another secure supported encryption
fine-tune:
  - Rule precision can be improved by excluding known old/legacy systems/apps and users
  - Rule can also applied with count-based correlation for the same host
level: high

# Correlation based on event count for the same host
# You need to change timespan and condition values according the your environment
action: correlation
name: multiple_kerberos_tgt_request_with_rc4_encryption_zeek_by_same_host
type: event_count
rule: kerberos_tgt_request_with_rc4_encryption_zeek
group-by:
  - id.orig_h
timespan: 5s
condition:
  gte: 5
weaknesses:
  - Attackers can bypass this correlation by slowing down their requests and changing the host
