title: Pre-Authentication Disabled on User Account (AS-REP Roasting)
name: preauthentication_disabled_on_user_account
description: Alert triggers when Pre-Authentication feature disabled through User Account Control attribute on a user account
version: 0.1
ttp: AS-REP Roasting
stage: 
  - Vulnerability
  - Persistence
status: test
performance: medium
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 27.07.2022
references: 
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/4ce3ddc0-aaaa-4a1b-b48b-62a07e906926
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/e720dd17-0703-4ce4-ab66-7ccf2d72c579#gt_4a7d4ea8-4b3d-4055-84a6-6c61c2ee68ec
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/ae60c948-fda8-45c2-b1d1-a71b484dd1f7
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4738
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-user-account-management
tags:
    - attack.credential_access
    - attack.t1558.004
    - attack.persistence
    - attack.t1098
logsource: 
  product: windows
  service: security
  definition: 
    - Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > Account Management > Audit User Account Management
detection: 
  selection: 
    EventID: 4738
    Message|contains: "'Don't Require Preauth' - Enabled"
  condition: selection
falsepositives: 
  - Legitimate modification on user objects which disable pre-authentication (Low)
weaknesses:
  - none
fine-tune:
  - Rule performance can be improved if SIEM product successfully parse Message and UserAccountControl fields
level: critical
