title: ntSecurityDescriptor Attribute Modification
name: ntSecurityDescriptor_attribute_modification
description: Alert triggers when the ntSecurityDescriptor attribute is modified
version: 0.1
ttp: Multiple
stage: 
  - Persistence
status: experimental
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 25.07.2023
references: 
  - https://learn.microsoft.com/en-us/windows/win32/adschema/a-ntsecuritydescriptor
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-directory-service-changes
tags:
    - attack.credential_access
    - t1003.006
    - attack.persistence
    - attack.t1003
logsource: 
  product: windows
  service: security
  definition:
    - Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > DS Access > Audit Directory Service Changes
detection: 
  selection: 
    EventID: 5136
    LDAP_Display_Name: "ntSecurityDescriptor"
    Type: "Value Added"
    Value|contains: 
      - "1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2" # DS-Replication-Get-Changes and DS-Replication-Get-Changes-All Guids
      - "89e95b76-444d-4c62-991a-0facbeda640c" # DS-Replication-Get-Changes-In-Filtered-Set Guid
  condition: selection
falsepositives: 
  - Legitimate or product related write actions on ntSecurityDescriptor attribute (Medium)
  - ntSecurityDescriptor modification for flags other than Replicating Directory Changes, Replicating Directory Changes All
weaknesses:
  - none
fine-tune:
  - Decoy accounts can be used with this rule to reduce the FP rate
  - Rule precision can be improved by excluding known objects which modifies ntSecurityDescriptor attribute
level: high
