title: UserAccountControl Attribute Modification
name: userAccountControl_attribute_modification
description: Alert triggers when the User Account Control attribute is modified
version: 0.1
ttp: Multiple
stage: 
  - Vulnerability
  - Persistence
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 10.08.2022
references: 
  - https://docs.microsoft.com/en-us/windows/win32/adschema/a-useraccountcontrol
  - https://docs.microsoft.com/en-us/troubleshoot/windows-server/identity/useraccountcontrol-manipulate-account-properties
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-directory-service-changes
tags:
    - attack.persistence
    - attack.t1098
logsource: 
  product: windows
  service: security
  definition:
    - Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > DS Access > Audit Directory Service Changes
    - Requires SACL definition with "Write User Account Control" permission for "Everyone" principal on the object to audit write actions by anyone.
detection: 
  selection: 
    EventID: 5136
    LDAP_Display_Name: "userAccountControl"
    Type: "Value Added"
  reduction:
    Account_Name|endswith: "$" # Exclude machine accounts (Subject)
  condition: selection and not reduction
falsepositives: 
  - Legitimate or product related write on UserAccountControl attribute (Medium)
  - UserAccountControl modification for flags other than TRUSTED_FOR_DELEGATION
weaknesses:
  - Attackers can bypass this rule with using a compromised machine account because of the reduction
fine-tune:
  - Hex calculations on the Value attribute for TRUSTED_FOR_DELEGATION (0x80000) will reduce the FP rate
  - Decoy accounts can be used with this rule to reduce the FP rate
  - Rule precision can be improved by excluding known objects which modifies UserAccountControl attribute
  - Subject reduction can be applied through SACL with deny entries
level: medium
