title: ServicePrincipalName Attribute Modification on User Accounts
name: servicePrincipalName_attribute_modification_on_user_accounts
description: Alert triggers when the new SPN added to ServicePrincipalName attribute for user accounts
version: 0.1
ttp: Kerberoasting
stage: 
  - Vulnerability
  - Persistence (Targeted Kerberoasting)
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 01.08.2022
references:
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/cd328386-4d97-4666-be33-056545c1cad2
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/e720dd17-0703-4ce4-ab66-7ccf2d72c579#gt_547217ca-134f-4b43-b375-f5bca4c16ce4
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-directory-service-changes
  - https://docs.microsoft.com/en-us/windows/win32/adschema/a-serviceprincipalname
tags:
    - attack.credential_access
    - attack.t1558.003
    - attack.persistence
    - attack.t1098
logsource: 
  product: windows
  service: security
  definition: 
    - Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > DS Access > Audit Directory Service Changes
    - Requires SACL definition with "Write ServicePrincipalName" permission for "Everyone" principal on the object to audit write actions by anyone. 
    - SACL definition for ServicePrincipalName attribute can't be done manually. You can use this script to define SACL - https://gitlab.com/forestallio/blog/-/blob/blog/TTP%200x2%20Kerberoasting/ps1/Create-SACL.ps1
detection: 
  selection: 
    EventID: 5136
    LDAP_Display_Name: "servicePrincipalName"
    Type: "Value Added"
  reduction1:
    Class: "user" # Filter only user objects (Object)
  reduction2:
    Account_Name|endswith: "$" # Exclude machine accounts (Subject)
  condition: selection and reduction1 and not reduction2
falsepositives:
  - Legitimate or product related write actions on servicePrincipalName attribute (Low)
weaknesses:
  - Attackers can bypass this rule with using a compromised machine account because of the reduction2
fine-tune:
  - Decoy accounts can be used with this rule to reduce the FP rate
  - Rule precision can be improved by excluding known objects which modifies servicePrincipalName attribute
  - Subject reduction can be applied through SACL with deny entries
level: high
