title: Kerberos TGT Request for Unconstrained Delegation
name: kerberos_tgt_request_for_unconstrained_delegation
description: Alert Triggers when the Kerberos TGT Request for Unconstrained Delegation
version: 0.1
ttp: Unconstrained Delegation
stage: 
  - Exploitation
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 10.08.2022
references:
  - https://adsecurity.org/?p=1667
  - https://exploit.ph/user-constrained-delegation.html
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4769
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-kerberos-service-ticket-operations

tags:
  - 
logsource: 
  product: windows
  service: security
  definition: Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > Account Logon > Audit Kerberos Service Ticket Operations
detection: 
  selection: 
    EventID: 4769
    Service_Name: "krbtgt"  
    Ticket_Options: "0x60810010"
  reduction: 
    Account_Name|contains: "$" # Exclude machine accounts, especially DCs
  condition: selection and not reduction
falsepositives:
  - DC should be excluded
level: medium
