title: Group ID Control on Group Membership
name: groupıd_control_on_group_membership
description: Alert triggers when the Group ID does not match 
version: 0.1
ttp: Golden Ticket
stage: 
  - Exploitation
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 15.11.2022
references:
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4627
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-group-membership
tags:
    - attack.credential_access
    - attack.t1558.001
logsource: 
  product: windows
  service: security
  definition: Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > Logon/Logoff > Audit Group Membership
detection: 
  selection: 
    EventID: 4627
    Message|contains: "{S-1-5-21-*-544}"
  reduction1:
    Account_Name: "administrator"  #Exclude Administrator accounts
  reduction2:
    Account_Name|endswith: "$" # Exclude machine accounts, especially DCs
  condition: selection and not (reduction1 and reduction2)
falsepositives:
  - none
level: medium