title: Security ID Control on Administrator Account
name: securityıd_control_on_administrator_account
description: The alert is triggered when the Admin Security ID does not match
version: 0.1
ttp: Golden Ticket
stage: 
  - Exploitation
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 11.11.2022
references:
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4672
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-logon
tags:
    - attack.credential_access
    - attack.t1558.001
logsource: 
  product: windows
  service: security
  definition: Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > Logon/Logoff > Audit Special Logon
detection: 
  selection: 
    EventID: 4672
    Security_ID|endswith: "-500" # Administrator SID value
  reduction:
    Account_Name: "administrator" # Exclude Administrator accounts (Object)
  condition: selection and not reduction
falsepositives:
  - none
level: medium