title: Security ID Control on Group Membership
name: securityıd_control_on_group_membership
description: Alert triggers when the User Security ID is diffrent 
version: 0.1
ttp: Golden Ticket
stage: 
  - Exploitation
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 08.11.2022
references:
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4627
  - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-group-membership
tags:
    - attack.credential_access
    - attack.t1558.001
logsource: 
  product: windows
  service: security
  definition: Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > Logon/Logoff > Audit Group Membership
detection: 
  selection: 
    EventID: 4627
    Security_ID|endswith: "-500" # Administrator SID value
  reduction:
    Account_Name: "administrator"
  condition: selection and not reduction
falsepositives:
  - none
level: medium
