title: DES Encryption Enabled
description: Alert triggers when the DES Encryption Enabled
version: 0.1
ttp: Multiple
stage: 
  - Vulnerability
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 01.08.2022
references:
  - https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/decrypting-the-selection-of-supported-kerberos-encryption-types/ba-p/1628797
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4738
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-kerberos-service-ticket-operations
  - https://docs.microsoft.com/tr-tr/archive/blogs/askds/hunting-down-des-in-order-to-securely-deploy-kerberos
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-user-account-management
tags:
    - attack.credential_access
    - attack.t1558.003
logsource: 
  product: windows
  service: security
  definition: 
    - Requires SACL definition with "Write msDS-SupportedEncryptionTypes" permission for "Everyone" principal on the object to audit write actions by anyone.
    - Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > Account Management > Audit User Account Management
detection: 
  selection: 
    EventID: 4738
    Message|contains : "'Use DES Key Only' - Enabled" 
  reduction:
    Account_Name|endswith: "$" # Exclude machine accounts, especially DCs
  condition: selection and not reduction
falsepositives:
  - none
level: medium
