title: msDS-SupportedEncryptionTypes Added
description: Alert triggers when the msDS-SupportedEncryptionTypes Added
version: 0.1
ttp: Multiple
stage: 
  - Vulnerability
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 01.08.2022
references:
  - https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/decrypting-the-selection-of-supported-kerberos-encryption-types/ba-p/1628797
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-directory-service-changes
  - https://docs.microsoft.com/tr-tr/archive/blogs/motiba/detecting-kerberoasting-activity-using-azure-security-center
tags:
    - attack.credential_access
    - attack.t1558.003
logsource: 
  product: windows
  service: security
  definition: 
    - Requires SACL definition with "Write msDS-SupportedEncryptionTypes" permission for "Everyone" principal on the object to audit write actions by anyone.
    - Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > Ds acces > Audit Directory Service Changes
detection: 
  selection: 
    EventID: 5136
    LDAP_Display_Name: msDS-SupportedEncryptionTypes
    Type: Value Added
  reduction:
    Account_Name|endswith: "$" # Exclude machine accounts, especially DCs
  condition: selection and not reduction
falsepositives:
  - none
level: medium
