title: Kerberos TGT Request without Pre-Authentication (AS-REP Roasting)
name: kerberos_tgt_request_without_preauthentication
description: Alert triggers when the Kerberos AS-REQ request is made without pre-authentication
version: 0.1
ttp: AS-REP Roasting
stage: 
  - Exploitation
status: test
performance: high
author: 
  - linkedin: serdal-tarkan-altun
  - twitter: TarkanSerdal
date: 27.07.2022
references: 
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/4ce3ddc0-aaaa-4a1b-b48b-62a07e906926
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/e720dd17-0703-4ce4-ab66-7ccf2d72c579#gt_4a7d4ea8-4b3d-4055-84a6-6c61c2ee68ec
  - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-kile/ae60c948-fda8-45c2-b1d1-a71b484dd1f7
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4768
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4768#table-5-kerberos-pre-authentication-types
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-kerberos-authentication-service
tags:
    - attack.credential_access
    - attack.t1558.004
logsource: 
  product: windows
  service: security
  definition: Enable required policy - Computer Configuration > Policies > Windows Settings > Security Settings > Advanced Audit Policy > Audit Policy > Account Logon > Audit Kerberos Authentication Service
detection: 
  selection: 
    EventID: 4768
    Pre_Authentication_Type: 0
  condition: selection
falsepositives: 
  - Legitimate TGT requests by pre-authentication disabled accounts (Low)
weaknesses:
  - none
fine-tune:
  - Rule precision can be improved by excluding known old/legacy systems/apps and users
  - Rule can also applied with count-based correlation for the same host
level: critical

# Correlation based on event count for the same host
# You need to change timespan and condition values according the your environment
action: correlation
name: multiple_kerberos_tgt_request_without_preauthentication_by_same_host
type: event_count
rule: kerberos_tgt_request_without_preauthentication
group-by:
  - Client_Address
timespan: 5s
condition:
  gte: 5
weaknesses:
  - Attackers can bypass this correlation by slowing down their requests and changing the host